{"pages":[{"text":"Surf through the site of the goddamn cool, smart and handsome students of 8-STA. See, the memories and history of Batch S' 8-STA. Welcome to our page, classmates and batchmates where we highlight our batch events, trips and the fun times in our campus. And as David Andal said: \"Orayt!!! Rock n' Roll to the world!\"","url":"http://8-sta.github.io/pages/about.html","tags":"pages","title":"About"},{"text":"CN Name 1 Almazan, Uzziel 2 Andal, David 3 Aresta, Rufino 4 Arizabal, Aldrich 5 Ayuyao, Justin 6 Basconcillo, Austin 7 Carmona, Francis 8 Celino, Hans 9 Cleofas, Lenard 10 Comla, Arton 11 Cortez, Jose Luis 12 Delgado, Fragne 13 Dimatera, Joe 14 Espina, Alaric 15 Fabian, Philippe 16 Gador, Angelo 17 Geli, Raphael 18 Imperial, Austin 19 Inting, Reece 20 Irigon, Hans 21 Jamandre, John Matthew 22 Julian, Christian 23 Kusuda, Riyu 24 Lacsamana, Lyle 25 Lim, Lawrence 26 Lirag, Ralph 27 Maglalang, Jeremy 28 Miranda, Gerbi 29 Olavere, Lance 30 Palenzuela, John Alwin 31 Poralan, Sergio 32 Quimson, Voriz 33 Ramos, Jakob 34 Relente, Julian 35 Robledo, Robert 36 Roldan, Nathan 37 Ronquillo, Craig 38 Sebastian, Joseph 39 Valera, Luis 40 Vecina, Ramon 41 Yadao, Lanz","url":"http://8-sta.github.io/pages/class-list.html","tags":"pages","title":"Class List"},{"text":"You can either contact one of us: President Julian Miguel A. Relente Vice President John Alwin Palenzuala Secretary Fragne Jaunte Uy Delgado Treasurer Philippe Nathaniel E. Fabian | FlamBOYonous Peaceweaver Uzziel Angelo Almazan Earthkeeper Jose Luis P. Cortez Liturgical Team Leader Christian Francis F. Julian | Ian/CJulian Documentation Team Leader Austin G. Imperial | akaNiknok or you can Email us here:","url":"http://8-sta.github.io/pages/contact.html","tags":"pages","title":"Contact"},{"text":"Officers Position Name President Julian Miguel A. Relente Vice President John Alwin Palenzuela Secretary Fragne Jaunte Uy Delgado Treasurer Philippe Nathaniel E. Fabian Responsible Teams Name Team Leader Members Peaceweavers Uzziel Angelo Almazan Arizabal Celino Comla Dimatera Geli Irigon Maglalang Sebastian Earthkeeper Jose Luis P. Cortez Cleofas Espina Lim Lirag Robledo Valera Vecina Yadao Liturgical Team Christian Francis F. Julian Ayuyao Inting Jamandre Miranda Olavere Poralan Quimson Ramos Documentation Team Austin G. Imperial Andal Aresta Basconcillo Carmona Gador Kusuda Lacsamana Roldan Ronquillo","url":"http://8-sta.github.io/pages/officers-responsible-teams.html","tags":"pages","title":"Officers & Responsible Teams"},{"text":"The first project from the class officers is a success! Expect more interesting and exicting projects from our officers this school year! Feel free to comment and suggest anything related to this website below!","url":"http://8-sta.github.io/8-stas-website-is-now-live-on-the-world-wide-web.html","tags":"Projects by Class Officers","title":"8-STA's Website is now LIVE on the World Wide Web!"},{"text":"Image by Mr. Raniel Mata Congratulations to all Officers who won the elections for SY 2015-2016!!! Here is the list of the class elected officers who will hopefully do their respective responsibilites. Position Name President Julian Miguel A. Relente Vice President John Alwin Palenzuela Secretary Fragne Jaunte Uy Delgado Treasurer Philippe Nathaniel E. Fabian Peaceweaver Uzziel Angelo Almazan Earthkeeper Jose Luis P. Cortez Liturgical Team Leader Christian Francis F. Julian Documentation Team Leader Austin G. Imperial For the officers, let us always remember what Benjamin Parker said:","url":"http://8-sta.github.io/elections-of-class-officers-for-sy-2015-2016.html","tags":"Classroom Events & Activities","title":"Elections of Class Officers for SY 2015-2016"}]}